In [4]:
import pandas as pd

data = {
    "Name": ["Ravi", "Sita", "Amit", "Priya", "Kiran", "Anita"],
    "Age": [25, 30, 22, 28, 35, 27],
    "Salary": [50000, 60000, 45000, 70000, 80000, 52000],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "Finance"]
}


df=pd.DataFrame(data)
df

    Name  Age  Salary Department
0   Ravi   25   50000         HR
1   Sita   30   60000         IT
2   Amit   22   45000    Finance
3  Priya   28   70000         IT
4  Kiran   35   80000         HR
5  Anita   27   52000    Finance

In [ ]:
df.head(2) # First 2 records

   Name  Age  Salary Department
0  Ravi   25   50000         HR
1  Sita   30   60000         IT

In [ ]:
df.sample(2) # give us random of 3 records

    Name  Age  Salary Department
4  Kiran   35   80000         HR
5  Anita   27   52000    Finance

In [ ]:
df.head() # Default 5 records

    Name  Age  Salary Department
0   Ravi   25   50000         HR
1   Sita   30   60000         IT
2   Amit   22   45000    Finance
3  Priya   28   70000         IT
4  Kiran   35   80000         HR

In [21]:
print(df)
print("===============================")
df.sample() # Default 1 record

    Name  Age  Salary Department
0   Ravi   25   50000         HR
1   Sita   30   60000         IT
2   Amit   22   45000    Finance
3  Priya   28   70000         IT
4  Kiran   35   80000         HR
5  Anita   27   52000    Finance
===============================

   Name  Age  Salary Department
0  Ravi   25   50000         HR

In [ ]:
print(df)
print("===============================")
df.tail() # give us last 5 records by default

    Name  Age  Salary Department
0   Ravi   25   50000         HR
1   Sita   30   60000         IT
2   Amit   22   45000    Finance
3  Priya   28   70000         IT
4  Kiran   35   80000         HR
5  Anita   27   52000    Finance
===============================

    Name  Age  Salary Department
1   Sita   30   60000         IT
2   Amit   22   45000    Finance
3  Priya   28   70000         IT
4  Kiran   35   80000         HR
5  Anita   27   52000    Finance

In [ ]:
df.tail(2)

    Name  Age  Salary Department
4  Kiran   35   80000         HR
5  Anita   27   52000    Finance

In [23]:
print(df)
print("===============================")
df.shape

    Name  Age  Salary Department
0   Ravi   25   50000         HR
1   Sita   30   60000         IT
2   Amit   22   45000    Finance
3  Priya   28   70000         IT
4  Kiran   35   80000         HR
5  Anita   27   52000    Finance
===============================

(6, 4)

In [26]:
print(df)
print("======================================================")
df.info()

    Name  Age  Salary Department
0   Ravi   25   50000         HR
1   Sita   30   60000         IT
2   Amit   22   45000    Finance
3  Priya   28   70000         IT
4  Kiran   35   80000         HR
5  Anita   27   52000    Finance
======================================================
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Age         6 non-null      int64
 2   Salary      6 non-null      int64
 3   Department  6 non-null      object
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [28]:
df.describe()

             Age        Salary
count   6.000000      6.000000
mean   27.833333  59500.000000
std     4.445972  13322.912594
min    22.000000  45000.000000
25%    25.500000  50500.000000
50%    27.500000  56000.000000
75%    29.500000  67500.000000
max    35.000000  80000.000000

In [33]:
print(df)
print("===================================================")
df.dtypes

    Name  Age  Salary Department
0   Ravi   25   50000         HR
1   Sita   30   60000         IT
2   Amit   22   45000    Finance
3  Priya   28   70000         IT
4  Kiran   35   80000         HR
5  Anita   27   52000    Finance
===================================================

Name          object
Age            int64
Salary         int64
Department    object
dtype: object

In [35]:
print(df)
print("===================================================")
df.columns

    Name  Age  Salary Department
0   Ravi   25   50000         HR
1   Sita   30   60000         IT
2   Amit   22   45000    Finance
3  Priya   28   70000         IT
4  Kiran   35   80000         HR
5  Anita   27   52000    Finance
===================================================

Index(['Name', 'Age', 'Salary', 'Department'], dtype='object')

In [37]:
print(df)
print("===================================================")
df.index

    Name  Age  Salary Department
0   Ravi   25   50000         HR
1   Sita   30   60000         IT
2   Amit   22   45000    Finance
3  Priya   28   70000         IT
4  Kiran   35   80000         HR
5  Anita   27   52000    Finance
===================================================

RangeIndex(start=0, stop=6, step=1)